Repository: Mohamed1226/Roaa-Weather
Catalog: lib/l10n/intl_*.arb
Languages: ar_eg

source: Splash Screen From Flutter
ar_eg: مرحبا بك في فلاتر

source: Roaa Weather App
ar_eg: رؤى مع تطبيق الطقس

# login
source: Sign In
ar_eg: تسجيل الدخول

source: Name
ar_eg: الاسم

source: enter your Name
ar_eg: ادخل الاسم الخاص بك

source: Name can not be empty
ar_eg: الاسم لا يمكن ان يكون فارغ

source: phone
ar_eg: قم التليفون

# enter_your_phone
source: enter yur phone
ar_eg: ادخل رقم التليفون الخاص بك

# phone_can_not_be_empty
source: phone number required
ar_eg: رقم التليفون لا يمكن ان يكون فارغ

source: Email
ar_eg: الايميل

source: enter your email
ar_eg: ادخل الايميل الخاص بك

source: email can not be empty
ar_eg: الايميل لا يمكن ان يكون فارغ

source: Not Correct Email
ar_eg: الايميل غير صحيح

source: password
ar_eg: الباسورد

source: Enter Your Password
ar_eg: ادخل الباسورد الخاص بك

source: Password can not be empty
ar_eg: الباسورد لا يمكن ان يكون فارغ

source: Not Strong Password
ar_eg: الباسورد ضعيف

source: Confirm Password
ar_eg: تأكيد الباسورد

source: Confirm Your Password
ar_eg: أكد الباسورد الخاص بك

source: Forget Password
ar_eg: نسيت الباسورد

source: passwords not matches
ar_eg: من فضلك ادخل نفس الباسورد

source: Remember Me
ar_eg: تذكرني

source: LOGIN
ar_eg: تسجيل

source: -OR-
ar_eg: أو

source: Sign in with
ar_eg: سجل بواسطه

# Dont_have_account
source: Dont Have an email?
ar_eg: لا تمتلك حساب؟

# have_account
source: have an account?
ar_eg: لديك حساب؟

source: Sign up
ar_eg: أنشئ حساب

source: REGISTER
ar_eg: سجل

source: Open GPS
ar_eg: افتح الموقع

source: Sign Out
ar_eg: تسجيل خروج

# check_internet
source: please check internet connection to refresh your data
ar_eg: من فضلك تأكد من اتصالك بالانترنت

source: Flutter Weather
ar_eg: تطبيق الطقس

source: Search can not be empty
ar_eg: ادخل اسم دلوقتك

# search_country
source: Search For Your Country Weather
ar_eg: ابحث عن طقس دولتك

source: Wind
ar_eg: الرياح

source: Pressure
ar_eg: الضغط

source: FeelsLike
ar_eg: الشعور بالتحسن

source: Humidity
ar_eg: الرطوبه

# C
source: Â°C
ar_eg: °س
